README.org
* Code samples for the Practical Devops book
These are the code samples for the book "Practical Devops" by Joakim
Verona published by Packt Publishing.

The books home page:
https://www.packtpub.com/networking-and-servers/practical-devops

In most cases you will need the book to make the most out of the exercises.

Please ensure that you have the latest version of these exercises
before continuing.

To get the code samples from Github do:
#+BEGIN_SRC shell
git clone https://github.com/jave/practicaldevops.git
#+END_SRC

And to keep the samples updated, 
#+BEGIN_SRC shell
cd practicaldevops
git pull https://github.com/jave/practicaldevops.git
#+END_SRC

** ch3 How Architecture affects DevOps
*** Liquibase hello-world
#+BEGIN_SRC shell-script
cd ch3/liquibase-helloworld
mvn liquibase:update
#+END_SRC

*** Manual installation
#+BEGIN_SRC sh
dnf install postgresql
dnf install nginx
cd ch3/crm1
lein build
lein run
#+END_SRC
** ch4 Everything is code
*** Docker intermission
These instructions are for Fedora, but they are similar for other
distributions such as Ubuntu.

To make sure Docker is working properly,
see the following documentation for Fedora. 

https://docs.docker.com/v1.5/installation/fedora/

- For fedora 21 and later do: 
#+BEGIN_SRC sh
dnf  -y install docker
#+END_SRC

- docker-io was renamed to docker from Fedora 21, so use "docker-io" on older red hat
  derivates, "docker" on newer

- Use a sudo capable user to run docker commands, or the root user

- You can also add a docker group with rights to use the docker socket
  needed to communicate with the docker daemon.

This approach is described here
https://docs.docker.com/v1.5/installation/fedora/

In summary:
#+BEGIN_SRC sh
$ sudo groupadd docker
$ sudo chown root:docker /var/run/docker.sock
$ sudo usermod -a -G docker $USERNAME
#+END_SRC

- You might need "setenforce 0" to start docker.  The comand will
  disable selinux, which has security implications. Use this only on a
  test machine.

- To start and enable docker on reboot:
#+BEGIN_SRC sh
sudo systemctl start docker
sudo systemctl enable docker
#+END_SRC

To verify that docker works:
#+BEGIN_SRC sh
sudo docker run -i -t fedora /bin/bash
#+END_SRC

For some exercises you need to have docker-compose installed first.

On Fedora 23 you can do:
#+BEGIN_SRC sh
dnf install docker-compose
#+END_SRC

In earlier versions you needed to download docker-compose manually.
*** setting up a basic git server
bare repo:
#+BEGIN_SRC sh
cd /opt/git 
mkdir project.git
cd project.git
git init --bare
#+END_SRC

- Now try cloning, making changes, and pushing to the server
*** Gerrit 
Run a Gerrit container:
#+BEGIN_SRC sh
docker run -d -p 8080:8080 -p 29418:29418 openfrontier/gerrit
#+END_SRC

On the host machine you can now install the supporting git-review
package:
#+BEGIN_SRC sh
sudo dnf install git-review
#+END_SRC

Rebase your commits on top of the commits in the remote repository:
#+BEGIN_SRC sh
git pull --rebase origin master
#+END_SRC

Interactively edit the history, possibly squashing commits together to
make a more readable history:
#+BEGIN_SRC sh
git rebase -i origin/master
#+END_SRC


*** Gitlab

Now create a directory for gitlab, and fetch the compose file:
#+BEGIN_SRC sh
mkdir gitlab 
cd gitlab 
wget https://raw.githubusercontent.com/sameersbn/docker-gitlab/master/docker-compose.yml
#+END_SRC

Now start the gitlab stack.
#+BEGIN_SRC sh
docker-compose up
#+END_SRC

When the containers are up and running, access the web ui:

http://loaclhost:10080

and enter the following credentials:

- username: root
- password: 5iveL!fe



** ch5 Build the code
Create a "freestyle" class job in Jenkins that runs the "fortune"
command.

First install Jenkins.
#+BEGIN_SRC sh
dnf install jenkins
#+END_SRC

Then follow the instruction in the book to configure the job.
*** Cheating with FPM
To install fpm:
#+BEGIN_SRC sh
yum install rubygems
yum install ruby
yum install ruby-devel
gem install fpm
#+END_SRC

Package this shell script:
#+BEGIN_SRC sh
#!/bin/sh
echo 'Hello World!'

chmod a+x usr/local/bin/hello.sh
fpm -s dir -t rpm -n hello-world -v 1 -C installdir usr

rpm -qivp hello-world.rpm
rpm -ivh hello-world.rpm
#+END_SRC
