README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-02-07 Sun 21:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Joakim Verona" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline42">1. Code samples for the Practical Devops book</a>
<ul>
<li><a href="#orgheadline3">1.1. ch3 How Architecture affects DevOps</a>
<ul>
<li><a href="#orgheadline1">1.1.1. Liquibase hello-world</a></li>
<li><a href="#orgheadline2">1.1.2. Manual installation</a></li>
</ul>
</li>
<li><a href="#orgheadline8">1.2. ch4 Everything is code</a>
<ul>
<li><a href="#orgheadline4">1.2.1. Docker intermission</a></li>
<li><a href="#orgheadline5">1.2.2. setting up a basic git server</a></li>
<li><a href="#orgheadline6">1.2.3. Gerrit</a></li>
<li><a href="#orgheadline7">1.2.4. Gitlab</a></li>
</ul>
</li>
<li><a href="#orgheadline11">1.3. ch5 Build the code</a>
<ul>
<li><a href="#orgheadline9">1.3.1. Cheating with FPM</a></li>
<li><a href="#orgheadline10">1.3.2. Build servers, Jenkins in particular</a></li>
</ul>
</li>
<li><a href="#orgheadline20">1.4. ch6 Test the code</a>
<ul>
<li><a href="#orgheadline12">1.4.1. A Junit example</a></li>
<li><a href="#orgheadline13">1.4.2. Arquilian</a></li>
<li><a href="#orgheadline14">1.4.3. Automated acceptance testing</a></li>
<li><a href="#orgheadline19">1.4.4. A complete test automation scenario</a></li>
</ul>
</li>
<li><a href="#orgheadline27">1.5. ch7 Deploying the code</a>
<ul>
<li><a href="#orgheadline21">1.5.1. Executing code on the client</a></li>
<li><a href="#orgheadline22">1.5.2. Puppet master, Puppet agent</a></li>
<li><a href="#orgheadline23">1.5.3. Ansible</a></li>
<li><a href="#orgheadline24">1.5.4. Deploying with Chef</a></li>
<li><a href="#orgheadline25">1.5.5. Deploying with Saltstack</a></li>
<li><a href="#orgheadline26">1.5.6. Vagrant</a></li>
</ul>
</li>
<li><a href="#orgheadline33">1.6. ch8 Monitoring the code</a>
<ul>
<li><a href="#orgheadline28">1.6.1. Nagios</a></li>
<li><a href="#orgheadline29">1.6.2. Munin</a></li>
<li><a href="#orgheadline30">1.6.3. Ganglia</a></li>
<li><a href="#orgheadline31">1.6.4. Graphite</a></li>
<li><a href="#orgheadline32">1.6.5. Log handling</a></li>
</ul>
</li>
<li><a href="#orgheadline39">1.7. ch9 Issue Tracking</a>
<ul>
<li><a href="#orgheadline34">1.7.1. Bugzilla</a></li>
<li><a href="#orgheadline35">1.7.2. Trac</a></li>
<li><a href="#orgheadline36">1.7.3. Redmine</a></li>
<li><a href="#orgheadline37">1.7.4. The Gitlab issue tracker</a></li>
<li><a href="#orgheadline38">1.7.5. Jira</a></li>
</ul>
</li>
<li><a href="#orgheadline41">1.8. ch10 The Internet of Things and DevOps</a>
<ul>
<li><a href="#orgheadline40">1.8.1. NodeMCU</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-2">
<h2 id="orgheadline42"><span class="section-number-2">1</span> Code samples for the Practical Devops book</h2>
<div class="outline-text-2" id="text-1">
<p>
These are the code samples for the book "Practical Devops" by Joakim
Verona published by Packt Publishing.
</p>

<p>
The books home page:
<a href="https://www.packtpub.com/networking-and-servers/practical-devops">https://www.packtpub.com/networking-and-servers/practical-devops</a>
</p>

<p>
In most cases you will need the book to make the most out of the exercises.
</p>

<p>
Please ensure that you have the latest version of these exercises
before continuing.
</p>

<p>
To get the code samples from Github do:
</p>
<div class="org-src-container">

<pre class="src src-shell">git clone https://github.com/jave/practicaldevops.git
</pre>
</div>

<p>
And to keep the samples updated, 
</p>
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #96a5d9; font-style: italic;">cd</span> practicaldevops
git pull https://github.com/jave/practicaldevops.git
</pre>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">1.1</span> ch3 How Architecture affects DevOps</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-orgheadline1" class="outline-4">
<h4 id="orgheadline1"><span class="section-number-4">1.1.1</span> Liquibase hello-world</h4>
<div class="outline-text-4" id="text-1-1-1">
<div class="org-src-container">

<pre class="src src-shell-script"><span style="color: #96a5d9; font-style: italic;">cd</span> ch3/liquibase-helloworld
mvn liquibase:update
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-4">
<h4 id="orgheadline2"><span class="section-number-4">1.1.2</span> Manual installation</h4>
<div class="outline-text-4" id="text-1-1-2">
<div class="org-src-container">

<pre class="src src-sh">dnf install postgresql
dnf install nginx
<span style="color: #96a5d9; font-style: italic;">cd</span> ch3/crm1
lein build
lein run
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.2</span> ch4 Everything is code</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">1.2.1</span> Docker intermission</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
These instructions are for Fedora, but they are similar for other
distributions such as Ubuntu.
</p>

<p>
To make sure Docker is working properly,
see the following documentation for Fedora. 
</p>

<p>
<a href="https://docs.docker.com/v1.5/installation/fedora/">https://docs.docker.com/v1.5/installation/fedora/</a>
</p>

<ul class="org-ul">
<li>For fedora 21 and later do:</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">dnf  -y install docker
</pre>
</div>

<ul class="org-ul">
<li>docker-io was renamed to docker from Fedora 21, so use "docker-io" on older red hat
derivates, "docker" on newer</li>

<li>Use a sudo capable user to run docker commands, or the root user</li>

<li>You can also add a docker group with rights to use the docker socket
needed to communicate with the docker daemon.</li>
</ul>

<p>
This approach is described here
<a href="https://docs.docker.com/v1.5/installation/fedora/">https://docs.docker.com/v1.5/installation/fedora/</a>
</p>

<p>
In summary:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo groupadd docker
$ sudo chown root:docker /var/run/docker.sock
$ sudo usermod -a -G docker $<span style="color: #ff694d;">USERNAME</span>
</pre>
</div>

<ul class="org-ul">
<li>You might need "setenforce 0" to start docker.  The comand will
disable selinux, which has security implications. Use this only on a
test machine.</li>

<li>To start and enable docker on reboot:</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">sudo systemctl start docker
sudo systemctl enable docker
</pre>
</div>

<p>
To verify that docker works:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo docker run -i -t fedora /bin/bash
</pre>
</div>

<p>
For some exercises you need to have docker-compose installed first.
</p>

<p>
On Fedora 23 you can do:
</p>
<div class="org-src-container">

<pre class="src src-sh">dnf install docker-compose
</pre>
</div>

<p>
In earlier versions you needed to download docker-compose manually.
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">1.2.2</span> setting up a basic git server</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
bare repo:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #96a5d9; font-style: italic;">cd</span> /opt/git 
mkdir project.git
<span style="color: #96a5d9; font-style: italic;">cd</span> project.git
git init --bare
</pre>
</div>

<ul class="org-ul">
<li>Now try cloning, making changes, and pushing to the server</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-4">
<h4 id="orgheadline6"><span class="section-number-4">1.2.3</span> Gerrit</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
Run a Gerrit container:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -d -p 8080:8080 -p 29418:29418 openfrontier/gerrit
</pre>
</div>

<p>
On the host machine you can now install the supporting git-review
package:
</p>
<div class="org-src-container">

<pre class="src src-sh">sudo dnf install git-review
</pre>
</div>

<p>
Rebase your commits on top of the commits in the remote repository:
</p>
<div class="org-src-container">

<pre class="src src-sh">git pull --rebase origin master
</pre>
</div>

<p>
Interactively edit the history, possibly squashing commits together to
make a more readable history:
</p>
<div class="org-src-container">

<pre class="src src-sh">git rebase -i origin/master
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline7" class="outline-4">
<h4 id="orgheadline7"><span class="section-number-4">1.2.4</span> Gitlab</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
Now create a directory for gitlab, and fetch the compose file:
</p>
<div class="org-src-container">

<pre class="src src-sh">mkdir gitlab 
<span style="color: #96a5d9; font-style: italic;">cd</span> gitlab 
wget https://raw.githubusercontent.com/sameersbn/docker-gitlab/master/docker-compose.yml
</pre>
</div>

<p>
Now start the gitlab stack.
</p>
<div class="org-src-container">

<pre class="src src-sh">docker-compose up
</pre>
</div>

<p>
When the containers are up and running, access the web ui:
</p>

<p>
<a href="http://loaclhost:10080">http://loaclhost:10080</a>
</p>

<p>
and enter the following credentials:
</p>

<ul class="org-ul">
<li>username: root</li>
<li>password: 5iveL!fe</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.3</span> ch5 Build the code</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Create a "freestyle" class job in Jenkins that runs the "fortune"
command.
</p>

<p>
First install Jenkins.
</p>
<div class="org-src-container">

<pre class="src src-sh">dnf install jenkins
</pre>
</div>

<p>
Then follow the instruction in the book to configure the job.
</p>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">1.3.1</span> Cheating with FPM</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
To install fpm:
</p>
<div class="org-src-container">

<pre class="src src-sh">yum install rubygems
yum install ruby
yum install ruby-devel
gem install fpm
</pre>
</div>

<p>
Package this shell script:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #2872b2;">#</span><span style="color: #2872b2;">!/bin/</span><span style="color: #96a5d9; font-weight: bold;">sh</span>
<span style="color: #96a5d9; font-style: italic;">echo</span> <span style="color: #68f6cb;">'Hello World!'</span>

chmod a+x usr/local/bin/hello.sh
fpm -s dir -t rpm -n hello-world -v 1 -C installdir usr

rpm -qivp hello-world.rpm
rpm -ivh hello-world.rpm
</pre>
</div>
</div>
</div>
