README.org
*** Build servers, Jenkins in particular

#+BEGIN_SRC shell
dnf install jenkins
#+END_SRC

#+BEGIN_SRC shell
systemctl start jenkins
#+END_SRC

** ch6 Test the code
*** A Junit example
#+BEGIN_SRC shell
cd ch6/hello-junit
mvn install
#+END_SRC
*** Arquilian
There is an arquillian hello-world in the Arquillian documentation.
#+BEGIN_SRC java
git clone https://github.com/aslakknutsen/arquillian-example-helloworld.git
cd arquillian-example-helloworld
mvn install
#+END_SRC

*** Automated acceptance testing
There are two implementations, one with annotations, and one with
Lambda notation.

While the lambda notation is easier to read than the annotation
syntax, cucumbers lambda notation is fairly new and can be problematic
to get to work depending on your Java implementation.

To run the annotation based example: 
#+BEGIN_SRC java
cd ch6/hello-cucumber6
mvn clean test
#+END_SRC

To run the lambda based example: 
#+BEGIN_SRC java
cd ch6/hello-cucumber8
mvn clean test
#+END_SRC



*** A complete test automation scenario
**** hello-selenium-world
Hello selenium world is a minimal selenium example that should
open a firefox browser window and ask google 'hello world'.
You should see a list of search matches for 'hello world'.

It is useful to check that this example runs before testing other examples.
To run it:
#+BEGIN_SRC sh
cd ch6/hello-selenium
mvn test
#+END_SRC
**** Running the usermanager example manually
You will need Leiningen, http://leiningen.org/
https://raw.githubusercontent.com/technomancy/leiningen/stable/bin/lein
#+BEGIN_SRC sh
ch6/usermanager
lein run
#+END_SRC
**** Running the automated test
#+BEGIN_SRC sh
autotest_v1/bin/autotest.sh
#+END_SRC
**** Handling the tricky dependencies with Docker
#+BEGIN_SRC sh
docker run -d -p 4444:4444 --name selenium-hub selenium/hub
docker run -d --link selenium-hub:hub selenium/node-firefox
#+END_SRC
** ch7 Deploying the code
*** Executing code on the client
#+BEGIN_SRC sh
salt -E '.*' cmd.run 'ls -l'
#+END_SRC

*** Puppet master, Puppet agent

rfkrocktk/puppet is a convenient docker image for exploring puppet. 

- https://hub.docker.com/r/rfkrocktk/puppet/ this is the agent
- https://hub.docker.com/r/rfkrocktk/puppetmaster/ this is the master

#+BEGIN_SRC sh
docker --name dockerduck --hostname dockerduck -e PUPPETMASTER_TCP_HOST=ultramaster.example.com \
    -v /var/lib/docker/dockercontainer/puppet/ssl:/var/lib/puppet/ssl rfkrocktk/puppet
#+END_SRC

*** Ansible

#+BEGIN_SRC Dockerfile
FROM williamyeh/ansible:centos7
#+END_SRC

#+BEGIN_SRC sh
docker run -v `pwd`/ansible:/ansible  -it <hash> bash
cd /ansible
ansible-playbook -i inventory playbook.yml    --connection=local --sudo
#+END_SRC

A docker container which supports systemd:
#+BEGIN_SRC dockerfile
FROM fedora
RUN yum -y update; yum clean all
RUN yum install  ansible sudo
RUN systemctl mask systemd-remount-fs.service dev-hugepages.mount \
sys-fs-fuse-connections.mount \
systemd-logind.service getty.target console-getty.service
RUN cp /usr/lib/systemd/system/dbus.service /etc/systemd/system/;\
sed -i 's/OOMScoreAdjust=-900//' /etc/systemd/system/dbus.service

VOLUME ["/sys/fs/cgroup", "/run", "/tmp"]
ENV container=docker

CMD ["/usr/sbin/init"]
#+END_SRC

To run the new container:
#+BEGIN_SRC shell-script
docker run -it --rm -v /sys/fs/cgroup:/sys/fs/cgroup:ro  -v `pwd`/ansible:/ansible <hash>
#+END_SRC

Connect to the container:
#+BEGIN_SRC shell-script
docker exec -it <hash> bash
#+END_SRC

A slightly more advanced exercise:
#+BEGIN_SRC yaml
---
- hosts: localhost
  vars:
    http_port: 80
    max_clients: 200
  remote_user: root
  tasks:
  - name: ensure apache is at the latest version
    yum: name=httpd state=latest
  - name: write the apache config file
    template: src=/srv/httpd.j2 dest=/etc/httpd.conf
    notify:
    - restart apache
  - name: ensure apache is running (and enable it at boot)
    service: name=httpd state=started enabled=yes
  handlers:
    - name: restart apache
      service: name=httpd state=restarted
#+END_SRC


*** Deploying with Chef
Start a clean container for the exercise:
#+BEGIN_SRC sh
docker run -it ubuntu bash
#+END_SRC

Install Chef in the container:
#+BEGIN_SRC sh
curl -L https://www.opscode.com/chef/install.sh | bash
#+END_SRC

Verify the chef-solo was installed:
#+BEGIN_SRC shell-script
chef-solo -v
#+END_SRC

Fetch and unpack a pre-rolled chef configuration:
#+BEGIN_SRC shell-script
curl -L  http://github.com/opscode/chef-repo/tarball/master -o master.tgz
tar -zxf master.tgz
mv chef-repo* chef-repo
rm master.tgz
#+END_SRC

Create a configuration file for chef:
#+BEGIN_SRC shell-script
mkdir .chef
echo "cookbook_path [ '/root/chef-repo/cookbooks' ]" > .chef/knife.rb
#+END_SRC

Now create a template:
#+BEGIN_SRC shell-script
knife cookbook create phpapp
#+END_SRC

