README.html
<div id="outline-container-orgheadline10" class="outline-4">
<h4 id="orgheadline10"><span class="section-number-4">1.3.2</span> Build servers, Jenkins in particular</h4>
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">

<pre class="src src-shell">dnf install jenkins
</pre>
</div>

<div class="org-src-container">

<pre class="src src-shell">systemctl start jenkins
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">1.4</span> ch6 Test the code</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-orgheadline12" class="outline-4">
<h4 id="orgheadline12"><span class="section-number-4">1.4.1</span> A Junit example</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">

<pre class="src src-shell"><span style="color: #96a5d9; font-style: italic;">cd</span> ch6/hello-junit
mvn install
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">1.4.2</span> Arquilian</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
There is an arquillian hello-world in the Arquillian documentation.
</p>
<div class="org-src-container">

<pre class="src src-java">git <span style="color: #f5b55f;">clone</span> <span style="color: #ff694d;">https</span>:<span style="color: #2872b2;">//</span><span style="color: #2872b2;">github.com/aslakknutsen/arquillian-example-helloworld.git</span>
cd arquillian-example-helloworld
mvn install
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline14" class="outline-4">
<h4 id="orgheadline14"><span class="section-number-4">1.4.3</span> Automated acceptance testing</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
There are two implementations, one with annotations, and one with
Lambda notation.
</p>

<p>
While the lambda notation is easier to read than the annotation
syntax, cucumbers lambda notation is fairly new and can be problematic
to get to work depending on your Java implementation.
</p>

<p>
To run the annotation based example: 
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #f5b55f;">cd</span> <span style="color: #ff694d;">ch6</span>/hello-cucumber6
mvn clean test
</pre>
</div>

<p>
To run the lambda based example: 
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #f5b55f;">cd</span> <span style="color: #ff694d;">ch6</span>/hello-cucumber8
mvn clean test
</pre>
</div>
</div>
</div>



<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">1.4.4</span> A complete test automation scenario</h4>
<div class="outline-text-4" id="text-1-4-4">
</div><ol class="org-ol"><li><a id="orgheadline15"></a>hello-selenium-world<br  /><div class="outline-text-5" id="text-1-4-4-1">
<p>
Hello selenium world is a minimal selenium example that should
open a firefox browser window and ask google 'hello world'.
You should see a list of search matches for 'hello world'.
</p>

<p>
It is useful to check that this example runs before testing other examples.
To run it:
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #96a5d9; font-style: italic;">cd</span> ch6/hello-selenium
mvn test
</pre>
</div>
</div></li>
<li><a id="orgheadline16"></a>Running the usermanager example manually<br  /><div class="outline-text-5" id="text-1-4-4-2">
<p>
You will need Leiningen, <a href="http://leiningen.org/">http://leiningen.org/</a>
<a href="https://raw.githubusercontent.com/technomancy/leiningen/stable/bin/lein">https://raw.githubusercontent.com/technomancy/leiningen/stable/bin/lein</a>
</p>
<div class="org-src-container">

<pre class="src src-sh">ch6/usermanager
lein run
</pre>
</div>
</div></li>
<li><a id="orgheadline17"></a>Running the automated test<br  /><div class="outline-text-5" id="text-1-4-4-3">
<div class="org-src-container">

<pre class="src src-sh">autotest_v1/bin/autotest.sh
</pre>
</div>
</div></li>
<li><a id="orgheadline18"></a>Handling the tricky dependencies with Docker<br  /><div class="outline-text-5" id="text-1-4-4-4">
<div class="org-src-container">

<pre class="src src-sh">docker run -d -p 4444:4444 --name selenium-hub selenium/hub
docker run -d --link selenium-hub:hub selenium/node-firefox
</pre>
</div>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">1.5</span> ch7 Deploying the code</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21"><span class="section-number-4">1.5.1</span> Executing code on the client</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-sh">salt -E <span style="color: #68f6cb;">'.*'</span> cmd.run <span style="color: #68f6cb;">'ls -l'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">1.5.2</span> Puppet master, Puppet agent</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
rfkrocktk/puppet is a convenient docker image for exploring puppet. 
</p>

<ul class="org-ul">
<li><a href="https://hub.docker.com/r/rfkrocktk/puppet/">https://hub.docker.com/r/rfkrocktk/puppet/</a> this is the agent</li>
<li><a href="https://hub.docker.com/r/rfkrocktk/puppetmaster/">https://hub.docker.com/r/rfkrocktk/puppetmaster/</a> this is the master</li>
</ul>

<div class="org-src-container">

<pre class="src src-sh">docker --name dockerduck --hostname dockerduck -e <span style="color: #ff694d;">PUPPETMASTER_TCP_HOST</span>=ultramaster.example.com <span style="color: #68f6cb;">\</span>
    -v /var/lib/docker/dockercontainer/puppet/ssl:/var/lib/puppet/ssl rfkrocktk/puppet
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">1.5.3</span> Ansible</h4>
<div class="outline-text-4" id="text-1-5-3">
<div class="org-src-container">

<pre class="src src-Dockerfile">FROM williamyeh/ansible:centos7
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">docker run -v <span style="color: #fa8072;">`pwd`</span>/ansible:/ansible  -it &lt;hash&gt; bash
<span style="color: #96a5d9; font-style: italic;">cd</span> /ansible
ansible-playbook -i inventory playbook.yml    --connection=local --sudo
</pre>
</div>

<p>
A docker container which supports systemd:
</p>
<div class="org-src-container">

<pre class="src src-dockerfile"><span style="color: #96a5d9; font-weight: bold;">FROM</span> fedora
<span style="color: #96a5d9; font-weight: bold;">RUN</span> yum -y update; yum clean all
<span style="color: #96a5d9; font-weight: bold;">RUN</span> yum install  ansible sudo
<span style="color: #96a5d9; font-weight: bold;">RUN</span> systemctl mask systemd-remount-fs.service dev-hugepages.mount <span style="color: #68f6cb;">\</span>
sys-fs-fuse-connections.mount <span style="color: #68f6cb;">\</span>
systemd-logind.service getty.target console-getty.service
<span style="color: #96a5d9; font-weight: bold;">RUN</span> cp /usr/lib/systemd/system/dbus.service /etc/systemd/system/;<span style="color: #68f6cb;">\</span>
sed -i <span style="color: #68f6cb;">'s/OOMScoreAdjust=-900//'</span> /etc/systemd/system/dbus.service

<span style="color: #96a5d9; font-weight: bold;">VOLUME</span> [<span style="color: #68f6cb;">"/sys/fs/cgroup"</span>, <span style="color: #68f6cb;">"/run"</span>, <span style="color: #68f6cb;">"/tmp"</span>]
<span style="color: #96a5d9; font-weight: bold;">ENV</span> <span style="color: #ff694d;">container</span>=docker

<span style="color: #96a5d9; font-weight: bold;">CMD</span> [<span style="color: #68f6cb;">"/usr/sbin/init"</span>]
</pre>
</div>

<p>
To run the new container:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">docker run -it --rm -v /sys/fs/cgroup:/sys/fs/cgroup:ro  -v <span style="color: #fa8072;">`pwd`</span>/ansible:/ansible &lt;hash&gt;
</pre>
</div>

<p>
Connect to the container:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">docker exec -it &lt;hash&gt; bash
</pre>
</div>

<p>
A slightly more advanced exercise:
</p>
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #2872b2;">---</span>
- <span style="color: #ff694d;">hosts</span>: localhost
  <span style="color: #ff694d;">vars</span>:
    <span style="color: #ff694d;">http_port</span>: 80
    <span style="color: #ff694d;">max_clients</span>: 200
  <span style="color: #ff694d;">remote_user</span>: root
  <span style="color: #ff694d;">tasks</span>:
  - <span style="color: #ff694d;">name</span>: ensure apache is at the latest version
    <span style="color: #ff694d;">yum</span>: name=httpd state=latest
  - <span style="color: #ff694d;">name</span>: write the apache config file
    <span style="color: #ff694d;">template</span>: src=/srv/httpd.j2 dest=/etc/httpd.conf
    <span style="color: #ff694d;">notify</span>:
    - restart apache
  - <span style="color: #ff694d;">name</span>: ensure apache is running (and enable it at boot)
    <span style="color: #ff694d;">service</span>: name=httpd state=started enabled=yes
  <span style="color: #ff694d;">handlers</span>:
    - <span style="color: #ff694d;">name</span>: restart apache
      <span style="color: #ff694d;">service</span>: name=httpd state=restarted
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">1.5.4</span> Deploying with Chef</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Start a clean container for the exercise:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -it ubuntu bash
</pre>
</div>

<p>
Install Chef in the container:
</p>
<div class="org-src-container">

<pre class="src src-sh">curl -L https://www.opscode.com/chef/install.sh | bash
</pre>
</div>

<p>
Verify the chef-solo was installed:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">chef-solo -v
</pre>
</div>

<p>
Fetch and unpack a pre-rolled chef configuration:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">curl -L  http://github.com/opscode/chef-repo/tarball/master -o master.tgz
tar -zxf master.tgz
mv chef-repo* chef-repo
rm master.tgz
</pre>
</div>

<p>
Create a configuration file for chef:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">mkdir .chef
<span style="color: #96a5d9; font-style: italic;">echo</span> <span style="color: #68f6cb;">"cookbook_path [ '/root/chef-repo/cookbooks' ]"</span> &gt; .chef/knife.rb
</pre>
</div>

<p>
Now create a template:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">knife cookbook create phpapp
</pre>
</div>
</div>
</div>
