README.org
*** Deploying with Saltstack
Start a Saltstack container:
#+BEGIN_SRC sh
docker run -i -t --name=saltdocker_master_1 -h master -p 4505 -p 4506 \
   -p 8080 -p 8081 -e SALT_NAME=master -e SALT_USE=master \
   -v `pwd`/srv/salt:/srv/salt:rw jacksoncage/salt
#+END_SRC

Start a shell inside the Saltstack container:
#+BEGIN_SRC shell-script
docker exec -i -t saltdocker_master_1 bash
#+END_SRC

Salt state to install httpd:
#+BEGIN_SRC yaml
top.sls:
base:
  '*':
    - webserver

webserver.sls:
apache2:               # ID declaration
  pkg:                # state declaration
    - installed       # function declaration
#+END_SRC

Run this command to ensure the desired state:
#+BEGIN_SRC shell-script
salt-call --local state.highstate -l debug
#+END_SRC


*** Vagrant
#+BEGIN_SRC sh
yum install 'vagrant*'
#+END_SRC

To use Vagrants Virtualbox driver, you need to set up Virtualbox
according to your distribution.

Create a virtual machine with Vagrant from a recipy:
#+BEGIN_SRC shell-script
vagrant init hashicorp/precise32
#+END_SRC

Try starting the machine:
#+BEGIN_SRC shell-script
vagrant up
#+END_SRC

You can now ssh to the machine:
#+BEGIN_SRC shell-script
vagrant ssh
#+END_SRC

Add this to the Vagrant file:
#+BEGIN_SRC shell-script
Vagrant.configure("2") do |config|
  config.vm.box = "hashicorp/precise32"
  config.vm.provision :shell, path: "bootstrap.sh"
end
#+END_SRC

And create a bootstrap.sh file that will install Apache httpd:
#+BEGIN_SRC shell-script
#!/usr/bin/env bash
apt-get update
apt-get install -y apache2
#+END_SRC
** ch8 Monitoring the code
*** Nagios 
Start a Nagios container:
#+BEGIN_SRC sh
docker run -e     NAGIOSADMIN_USER=nagiosadmin -e NAGIOSAMDIN_PASS=nagios  -p 80:30000 cpuguy83/nagios 
#+END_SRC

Start a second container to monitor:
#+BEGIN_SRC sh
 docker run -p 30001:80 nginx
#+END_SRC

A docker compose file for the scenario:
#+BEGIN_SRC yml
nagios:
  image: mt-nagios 
  build:
    - mt-nagios
  ports:
   -  80:30000 
  environment:
    - NAGIOSADMIN_USER=nagiosadmin
    - NAGIOSAMDIN_PASS=nagios
  volumes:
   ./nagios:/etc/nagios   
nginx:
  image: nginx
#+END_SRC

Configuration files for the Nagios example:
#+BEGIN_SRC sh
define host {
    name        regular-host
    use         linux-server
    register       0
    max_check_attempts   5
}

define host{
    use             regular-host
    host_name       client1
    address         192.168.200.15
    contact_groups  admins
    notes           test client1
}
#+END_SRC
hostgroups.cfg

#+BEGIN_SRC sh
define hostgroup {
    hostgroup_name  test-group
    alias           Test Servers
    members         client1
}

services.cfg
#+BEGIN_SRC sh
define service {
    use                     generic-service
    hostgroup_name          test-group
    service_description     PING
    check_command           check_ping!200.0,20%!600.0,60%
}
#+END_SRC

An example mail configuration:
#+BEGIN_SRC sh
define contact{
    contact_name                    matangle-admin
    use                             generic-contact
    alias                           Nagios Admin
    email                           pd-admin@matangle.com
}

define contactgroup{
    contactgroup_name       admins
    alias                   Nagios Administrators
    members                 matange-admin
}
#+END_SRC

*** Munin
#+BEGIN_SRC sh
docker run -p 30005:80 lrivallain/munin:latest
#+END_SRC

Running commands in the munin container:
#+BEGIN_SRC sh
docker exec -it <hash> bash
su - munin --shell=/bin/bash
/usr/share/munin/munin-update 
#+END_SRC

If you are having trouble running munin-update, try:
#+BEGIN_SRC sh
chown munin.munin /var/log/munin/munin-update.log
#+END_SRC

It may still take some time for the graphs to display.

This is the code for the munin plugin:
#+BEGIN_SRC sh
graph_title Load average
graph_vlabel load
load.label load
#+END_SRC

To emit data you simply print it to stdout.


#+BEGIN_SRC sh
printf "load.value "
cut -d' ' -f2  /proc/loadavg
#+END_SRC

Here is an example script.


#+BEGIN_SRC sh
#!/bin/sh

case $1 in
   config)
        cat <<'EOM'
graph_title Load average
graph_vlabel load
load.label load
EOM
        exit 0;;
esac

printf "load.value "
cut -d' ' -f2  /proc/loadavg
#+END_SRC

*** Ganglia
To get help with the container:
#+BEGIN_SRC sh
docker run wookietreiber/ganglia --help
#+END_SRC

To run the Ganglia container:
#+BEGIN_SRC sh
 docker run -p 30010:80 wookietreiber/ganglia
#+END_SRC


*** Graphite
Start Graphite:
#+BEGIN_SRC sh
 docker run -it   -p 30020:80   -p 2003:2003   sitespeedio/graphite
#+END_SRC

Try the following url: http://localhost:30020/
*** Log handling
Start Kibana and Elasticsearch:
#+BEGIN_SRC sh
docker run -d elasticsearch &&
docker run --link some-elasticsearch:elasticsearch -d kibana
#+END_SRC

** ch9 Issue Tracking
*** Bugzilla
#+BEGIN_SRC shell-script
docker run -p 6050:80 dklawren/docker-bugzilla 
#+END_SRC
*** Trac
#+BEGIN_SRC shell-script
docker run -d -p 6051:8080 barogi/trac:1.0.2
#+END_SRC
