README.html

<div id="outline-container-orgheadline25" class="outline-4">
<h4 id="orgheadline25"><span class="section-number-4">1.5.5</span> Deploying with Saltstack</h4>
<div class="outline-text-4" id="text-1-5-5">
<p>
Start a Saltstack container:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -i -t --name=saltdocker_master_1 -h master -p 4505 -p 4506 <span style="color: #68f6cb;">\</span>
   -p 8080 -p 8081 -e <span style="color: #ff694d;">SALT_NAME</span>=master -e <span style="color: #ff694d;">SALT_USE</span>=master <span style="color: #68f6cb;">\</span>
   -v <span style="color: #fa8072;">`pwd`</span>/srv/salt:/srv/salt:rw jacksoncage/salt
</pre>
</div>

<p>
Start a shell inside the Saltstack container:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">docker exec -i -t saltdocker_master_1 bash
</pre>
</div>

<p>
Salt state to install httpd:
</p>
<div class="org-src-container">

<pre class="src src-yaml"><span style="color: #ff694d;">top.sls</span>:
<span style="color: #ff694d;">base</span>:
  <span style="color: #68f6cb;">'*'</span>:
    - webserver

<span style="color: #ff694d;">webserver.sls</span>:
<span style="color: #ff694d;">apache2</span>:               <span style="color: #2872b2;"># </span><span style="color: #2872b2;">ID declaration</span>
  <span style="color: #ff694d;">pkg</span>:                <span style="color: #2872b2;"># </span><span style="color: #2872b2;">state declaration</span>
    - installed       <span style="color: #2872b2;"># </span><span style="color: #2872b2;">function declaration</span>
</pre>
</div>

<p>
Run this command to ensure the desired state:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">salt-call --local state.highstate -l debug
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">1.5.6</span> Vagrant</h4>
<div class="outline-text-4" id="text-1-5-6">
<div class="org-src-container">

<pre class="src src-sh">yum install <span style="color: #68f6cb;">'vagrant*'</span>
</pre>
</div>

<p>
To use Vagrants Virtualbox driver, you need to set up Virtualbox
according to your distribution.
</p>

<p>
Create a virtual machine with Vagrant from a recipy:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">vagrant init hashicorp/precise32
</pre>
</div>

<p>
Try starting the machine:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">vagrant up
</pre>
</div>

<p>
You can now ssh to the machine:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">vagrant ssh
</pre>
</div>

<p>
Add this to the Vagrant file:
</p>
<div class="org-src-container">

<pre class="src src-shell-script"><span style="color: #bad6e2;">Vagrant.configure</span>(<span style="color: #68f6cb;">"2"</span>) <span style="color: #96a5d9; font-weight: bold;">do</span> |config|
  config.vm.box = <span style="color: #68f6cb;">"hashicorp/precise32"</span>
  config.vm.provision :shell, path: <span style="color: #68f6cb;">"bootstrap.sh"</span>
end
</pre>
</div>

<p>
And create a bootstrap.sh file that will install Apache httpd:
</p>
<div class="org-src-container">

<pre class="src src-shell-script"><span style="color: #2872b2;">#</span><span style="color: #2872b2;">!/usr/bin/</span><span style="color: #96a5d9; font-weight: bold;">env</span><span style="color: #2872b2;"> bash</span>
apt-get update
apt-get install -y apache2
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">1.6</span> ch8 Monitoring the code</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">1.6.1</span> Nagios</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Start a Nagios container:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -e     <span style="color: #ff694d;">NAGIOSADMIN_USER</span>=nagiosadmin -e <span style="color: #ff694d;">NAGIOSAMDIN_PASS</span>=nagios  -p 80:30000 cpuguy83/nagios
</pre>
</div>

<p>
Start a second container to monitor:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -p 30001:80 nginx
</pre>
</div>

<p>
A docker compose file for the scenario:
</p>
<div class="org-src-container">

<pre class="src src-yml">nagios:
  image: mt-nagios 
  build:
    - mt-nagios
  ports:
   -  80:30000 
  environment:
    - NAGIOSADMIN_USER=nagiosadmin
    - NAGIOSAMDIN_PASS=nagios
  volumes:
   ./nagios:/etc/nagios   
nginx:
  image: nginx
</pre>
</div>

<p>
Configuration files for the Nagios example:
</p>
<div class="org-src-container">

<pre class="src src-sh">define host {
    name        regular-host
    use         linux-server
    register       0
    max_check_attempts   5
}

define host{
    use             regular-host
    host_name       client1
    address         192.168.200.15
    contact_groups  admins
    notes           test client1
}
</pre>
</div>
<p>
hostgroups.cfg
</p>

<div class="org-src-container">

<pre class="src src-sh">define hostgroup {
    hostgroup_name  test-group
    <span style="color: #96a5d9; font-style: italic;">alias</span>           Test Servers
    members         client1
}

services.cfg
<span style="color: #2872b2;">#</span><span style="color: #2872b2;">+BEGIN_SRC sh</span>
define service {
    use                     generic-service
    hostgroup_name          test-group
    service_description     PING
    check_command           check_ping!200.0,20%!600.0,60%
}
</pre>
</div>

<p>
An example mail configuration:
</p>
<div class="org-src-container">

<pre class="src src-sh">define contact{
    contact_name                    matangle-admin
    use                             generic-contact
    <span style="color: #96a5d9; font-style: italic;">alias</span>                           Nagios Admin
    email                           pd-admin@matangle.com
}

define contactgroup{
    contactgroup_name       admins
    <span style="color: #96a5d9; font-style: italic;">alias</span>                   Nagios Administrators
    members                 matange-admin
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">1.6.2</span> Munin</h4>
<div class="outline-text-4" id="text-1-6-2">
<div class="org-src-container">

<pre class="src src-sh">docker run -p 30005:80 lrivallain/munin:latest
</pre>
</div>

<p>
Running commands in the munin container:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker exec -it &lt;hash&gt; bash
su - munin --shell=/bin/bash
/usr/share/munin/munin-update
</pre>
</div>

<p>
If you are having trouble running munin-update, try:
</p>
<div class="org-src-container">

<pre class="src src-sh">chown munin.munin /var/log/munin/munin-update.log
</pre>
</div>

<p>
It may still take some time for the graphs to display.
</p>

<p>
This is the code for the munin plugin:
</p>
<div class="org-src-container">

<pre class="src src-sh">graph_title Load average
graph_vlabel load
load.label load
</pre>
</div>

<p>
To emit data you simply print it to stdout.
</p>


<div class="org-src-container">

<pre class="src src-sh"><span style="color: #96a5d9; font-style: italic;">printf</span> <span style="color: #68f6cb;">"load.value "</span>
cut -d<span style="color: #68f6cb;">' '</span> -f2  /proc/loadavg
</pre>
</div>

<p>
Here is an example script.
</p>


<div class="org-src-container">

<pre class="src src-sh"><span style="color: #2872b2;">#</span><span style="color: #2872b2;">!/bin/</span><span style="color: #96a5d9; font-weight: bold;">sh</span>

<span style="color: #96a5d9; font-weight: bold;">case</span> $<span style="color: #ff694d;">1</span><span style="color: #96a5d9; font-weight: bold;"> in</span>
   config)
        cat &lt;&lt;<span style="color: #68f6cb;">'EOM'</span>
<span style="color: #ffff00; font-weight: bold;">graph_title Load average</span>
<span style="color: #ffff00; font-weight: bold;">graph_vlabel load</span>
<span style="color: #ffff00; font-weight: bold;">load.label load</span>
<span style="color: #ffff00; font-weight: bold;">EOM</span>
        <span style="color: #96a5d9; font-weight: bold;">exit</span> 0;;
<span style="color: #96a5d9; font-weight: bold;">esac</span>

<span style="color: #96a5d9; font-style: italic;">printf</span> <span style="color: #68f6cb;">"load.value "</span>
cut -d<span style="color: #68f6cb;">' '</span> -f2  /proc/loadavg
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">1.6.3</span> Ganglia</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
To get help with the container:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run wookietreiber/ganglia --help
</pre>
</div>

<p>
To run the Ganglia container:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -p 30010:80 wookietreiber/ganglia
</pre>
</div>
</div>
</div>


<div id="outline-container-orgheadline31" class="outline-4">
<h4 id="orgheadline31"><span class="section-number-4">1.6.4</span> Graphite</h4>
<div class="outline-text-4" id="text-1-6-4">
<p>
Start Graphite:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -it   -p 30020:80   -p 2003:2003   sitespeedio/graphite
</pre>
</div>

<p>
Try the following url: <a href="http://localhost:30020/">http://localhost:30020/</a>
</p>
</div>
</div>
<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">1.6.5</span> Log handling</h4>
<div class="outline-text-4" id="text-1-6-5">
<p>
Start Kibana and Elasticsearch:
</p>
<div class="org-src-container">

<pre class="src src-sh">docker run -d elasticsearch &amp;&amp;
docker run --link some-elasticsearch:elasticsearch -d kibana
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">1.7</span> ch9 Issue Tracking</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">1.7.1</span> Bugzilla</h4>
<div class="outline-text-4" id="text-1-7-1">
<div class="org-src-container">

<pre class="src src-shell-script">docker run -p 6050:80 dklawren/docker-bugzilla
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">1.7.2</span> Trac</h4>
<div class="outline-text-4" id="text-1-7-2">
<div class="org-src-container">

<pre class="src src-shell-script">docker run -d -p 6051:8080 barogi/trac:1.0.2
</pre>
</div>
</div>
</div>
