README.org
*** Redmine
#+BEGIN_SRC shell-script
docker run -d -p  6052:3000 redmine
#+END_SRC
*** The Gitlab issue tracker
Trying the Gitlab CLI:
#+BEGIN_SRC shell-script
GITLAB_API_PRIVATE_TOKEN=<token from your project>
GITLAB_API_ENDPOINT=http://gitlab.matangle.com:50003/api/v3
  gitlab help Issues
#+END_SRC
*** Jira
#+BEGIN_SRC shell-script
docker run -p 6053:8080 cptactionhank/atlassian-jira:latest
#+END_SRC

** ch10 The Internet of Things and DevOps
*** NodeMCU
To get a newer firmware(please change the version to the latest
available first):
#+BEGIN_SRC shell-script
wget https://github.com/nodemcu/nodemcu-firmware/releases/download/0.9.6-dev_20150704/nodemcu_integer_0.9.6-dev_20150704.bin
#+END_SRC

Get esptool:
#+BEGIN_SRC shell-script
git clone https://github.com/themadinventor/esptool.git
#+END_SRC

Install pyserial:
#+BEGIN_SRC shell-script
sudo dnf install pyserial
#+END_SRC

Burn the firmware:
#+BEGIN_SRC shell-script
sudo python ./esptool.py --port /dev/ttyUSB0 write_flash 0x00000 nodemcu_integer_0.9.6-dev_20150704.bin
#+END_SRC

You might need additional arguments:
#+BEGIN_SRC shell-script
sudo esptool.py --port=/dev/ttyUSB0 write_flash 0x0 nodemcu_integer_0.9.6-dev_20150704.bin  -fs 32m -fm dio -ff 40m
#+END_SRC

Do some tests to see that the connection is working:
#+BEGIN_SRC shell-script
sudo ./esptool.py read_mac
Connecting...
MAC: 18:fe:34:00:d7:21

sudo ./esptool.py flash_id
Connecting...
Manufacturer: e0
Device: 4016
#+END_SRC

Try the LED:
#+BEGIN_SRC lua
      gpio.write(0, gpio.LOW)  -- turn led on
#+END_SRC

#+BEGIN_SRC lua
      gpio.write(0, gpio.HIGH) -- turn led off
#+END_SRC

Blink the LED in a loop:
#+BEGIN_SRC lua
while 1 do                     -- loop forever
      gpio.write(0, gpio.HIGH) -- turn led off
      tmr.delay(1000000)       -- wait one second
      gpio.write(0, gpio.LOW)  -- turn led on
      tmr.delay(1000000)       -- wait one second
end
#+END_SRC
To connect to a wireless network.

#+BEGIN_SRC lua
wifi.setmode(wifi.STATION)
wifi.sta.config("SSID","password")
#+END_SRC

To see the IP we got:
#+BEGIN_SRC lua
print(wifi.sta.getip())
#+END_SRC

Connecting to a web server:
#+BEGIN_SRC lua
conn=net.createConnection(net.TCP, false) 
conn:on("receive", function(conn, pl) print(pl) end)
conn:connect(80,"121.41.33.127")
conn:send("GET / HTTP/1.1\r\nHost: www.nodemcu.com\r\n"
    .."Connection: keep-alive\r\nAccept: */*\r\n\r\n")
#+END_SRC

Timer:
#+BEGIN_SRC lua
    tmr.alarm(1, 1000, 1, function() 
        print("hello world") 
    end )
#+END_SRC

Stop the timer:
#+BEGIN_SRC lua
    tmr.stop(1)
#+END_SRC
