README.html
<div id="outline-container-orgheadline36" class="outline-4">
<h4 id="orgheadline36"><span class="section-number-4">1.7.3</span> Redmine</h4>
<div class="outline-text-4" id="text-1-7-3">
<div class="org-src-container">

<pre class="src src-shell-script">docker run -d -p  6052:3000 redmine
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">1.7.4</span> The Gitlab issue tracker</h4>
<div class="outline-text-4" id="text-1-7-4">
<p>
Trying the Gitlab CLI:
</p>
<div class="org-src-container">

<pre class="src src-shell-script"><span style="color: #ff694d;">GITLAB_API_PRIVATE_TOKEN</span>=&lt;token from your project&gt;
<span style="color: #ff694d;">GITLAB_API_ENDPOINT</span>=http://gitlab.matangle.com:50003/api/v3
  gitlab help Issues
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-4">
<h4 id="orgheadline38"><span class="section-number-4">1.7.5</span> Jira</h4>
<div class="outline-text-4" id="text-1-7-5">
<div class="org-src-container">

<pre class="src src-shell-script">docker run -p 6053:8080 cptactionhank/atlassian-jira:latest
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">1.8</span> ch10 The Internet of Things and DevOps</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-orgheadline40" class="outline-4">
<h4 id="orgheadline40"><span class="section-number-4">1.8.1</span> NodeMCU</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
To get a newer firmware(please change the version to the latest
available first):
</p>
<div class="org-src-container">

<pre class="src src-shell-script">wget https://github.com/nodemcu/nodemcu-firmware/releases/download/0.9.6-dev_20150704/nodemcu_integer_0.9.6-dev_20150704.bin
</pre>
</div>

<p>
Get esptool:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">git clone https://github.com/themadinventor/esptool.git
</pre>
</div>

<p>
Install pyserial:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">sudo dnf install pyserial
</pre>
</div>

<p>
Burn the firmware:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">sudo python ./esptool.py --port /dev/ttyUSB0 write_flash 0x00000 nodemcu_integer_0.9.6-dev_20150704.bin
</pre>
</div>

<p>
You might need additional arguments:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">sudo esptool.py --port=/dev/ttyUSB0 write_flash 0x0 nodemcu_integer_0.9.6-dev_20150704.bin  -fs 32m -fm dio -ff 40m
</pre>
</div>

<p>
Do some tests to see that the connection is working:
</p>
<div class="org-src-container">

<pre class="src src-shell-script">sudo ./esptool.py read_mac
Connecting...
MAC: 18:fe:34:00:d7:21

sudo ./esptool.py flash_id
Connecting...
Manufacturer: e0
Device: 4016
</pre>
</div>

<p>
Try the LED:
</p>
<div class="org-src-container">

<pre class="src src-lua">gpio.write(0, gpio.LOW)  <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">turn led on</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-lua">gpio.write(0, gpio.HIGH) <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">turn led off</span>
</pre>
</div>

<p>
Blink the LED in a loop:
</p>
<div class="org-src-container">

<pre class="src src-lua"><span style="color: #96a5d9; font-weight: bold;">while</span> 1 <span style="color: #96a5d9; font-weight: bold;">do</span>                     <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">loop forever</span>
      gpio.write(0, gpio.HIGH) <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">turn led off</span>
      tmr.delay(1000000)       <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">wait one second</span>
      gpio.write(0, gpio.LOW)  <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">turn led on</span>
      tmr.delay(1000000)       <span style="color: #2872b2;">-- </span><span style="color: #2872b2;">wait one second</span>
<span style="color: #96a5d9; font-weight: bold;">end</span>
</pre>
</div>
<p>
To connect to a wireless network.
</p>

<div class="org-src-container">

<pre class="src src-lua">wifi.setmode(wifi.STATION)
wifi.sta.config(<span style="color: #68f6cb;">"SSID"</span>,<span style="color: #68f6cb;">"password"</span>)
</pre>
</div>

<p>
To see the IP we got:
</p>
<div class="org-src-container">

<pre class="src src-lua"><span style="color: #96a5d9; font-style: italic;">print</span>(wifi.sta.getip())
</pre>
</div>

<p>
Connecting to a web server:
</p>
<div class="org-src-container">

<pre class="src src-lua">conn=net.createConnection(net.TCP, <span style="color: #afc0fd; font-weight: bold;">false</span>) 
conn:on(<span style="color: #68f6cb;">"receive"</span>, <span style="color: #96a5d9; font-weight: bold;">function</span>(conn, pl) <span style="color: #96a5d9; font-style: italic;">print</span>(pl) <span style="color: #96a5d9; font-weight: bold;">end</span>)
conn:connect(80,<span style="color: #68f6cb;">"121.41.33.127"</span>)
conn:send(<span style="color: #68f6cb;">"GET / HTTP/1.1\r\nHost: www.nodemcu.com\r\n"</span>
    ..<span style="color: #68f6cb;">"Connection: keep-alive\r\nAccept: */*\r\n\r\n"</span>)
</pre>
</div>

<p>
Timer:
</p>
<div class="org-src-container">

<pre class="src src-lua">tmr.alarm(1, 1000, 1, <span style="color: #96a5d9; font-weight: bold;">function</span>() 
    <span style="color: #96a5d9; font-style: italic;">print</span>(<span style="color: #68f6cb;">"hello world"</span>) 
<span style="color: #96a5d9; font-weight: bold;">end</span> )
</pre>
</div>

<p>
Stop the timer:
</p>
<div class="org-src-container">

<pre class="src src-lua">tmr.stop(1)
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joakim Verona</p>
<p class="date">Created: 2016-02-07 Sun 21:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
